### Definir un dataframe

In [1]:
import pandas as pd
import numpy as np

In [4]:
data = {'color': ["blue","rouge","green"],
        'object': ["ball","pen","carpet"],
        'price': [1,5,3]}

In [6]:
df = pd.DataFrame(data)
df

   color  object  price
0   blue    ball      1
1  rouge     pen      5
2  green  carpet      3

In [8]:
frame = pd.DataFrame(data, columns=['object','color'])
frame

   object  color
0    ball   blue
1     pen  rouge
2  carpet  green

In [10]:
frame = pd.DataFrame(data, index=['one','two','three'])
frame

       color  object  price
one     blue    ball      1
two    rouge     pen      5
three  green  carpet      3

In [12]:
frame.index.name = 'id'
frame.columns.name = 'item'
frame

item   color  object  price
id
one     blue    ball      1
two    rouge     pen      5
three  green  carpet      3

In [13]:
frame['new'] = 12 
frame

item   color  object  price  new
id
one     blue    ball      1   12
two    rouge     pen      5   12
three  green  carpet      3   12

In [39]:
print(frame[frame.isin([1, 'ball'])])

item  color object  price  new  four   2
id
one     NaN   ball    1.0  NaN   NaN NaN
two     NaN    NaN    NaN  1.0   NaN NaN
three   NaN    NaN    NaN  NaN   NaN NaN

In [42]:
del frame[2]
print(frame)

item   color  object  price
id
one     blue    ball      1
two    rouge     pen      5
three  green  carpet      3

In [43]:
data = {'color':[1,4,5,2,6], 'object': [1.90,4.2,6.2,9.0,5.4],'price':[1.4,2.5,2.5,6.8,5.4]}
frame = pd.DataFrame(data)
print(frame[frame<1.2])

   color  object  price
0    1.0     NaN    NaN
1    NaN     NaN    NaN
2    NaN     NaN    NaN
3    NaN     NaN    NaN
4    NaN     NaN    NaN

In [44]:
frame = frame.T
frame

          0    1    2    3    4
color   1.0  4.0  5.0  2.0  6.0
object  1.9  4.2  6.2  9.0  5.4
price   1.4  2.5  2.5  6.8  5.4

#### Exercise 1
use python dictionary and pandas in order to create the below dataframe

In [48]:
data = { 'x': [56,78,23,56,28,94],'y': [56,33,23,89,59,94],'z': [54,72,23,56,20,94]}
df = pd.DataFrame(data)
df

    x   y   z
0  56  56  54
1  78  33  72
2  23  23  23
3  56  89  56
4  28  59  20
5  94  94  94

#### Exercise 2
create the below dataframe using python dictionary and pandas. Add the index labels to the dataframe 
- ['a','b','c','d','e','f','g','h','i','j']

In [51]:
from math import nan


index = ['a','b','c','d','e','f','g','h','i','j']
name = ['jose','juan','alberto','ksks','isis','osmel','islwhg','xbnd','iehgb','cbvm']
score = [23, 34, 456, 87, nan, 34, 65, nan ,45 ,65]
attemps = [1,1,2,2,3,3,4,4,5,6]
qualify = ['yes','no','yes','no','yes','yes','no','yes','no','yes']
data = {'name':name,'score':score,'attemps':attemps,'qualify':qualify}
df = pd.DataFrame(data, index = index)
df

      name  score  attemps qualify
a     jose   23.0        1     yes
b     juan   34.0        1      no
c  alberto  456.0        2     yes
d     ksks   87.0        2      no
e     isis    NaN        3     yes
f    osmel   34.0        3     yes
g   islwhg   65.0        4      no
h     xbnd    NaN        4     yes
i    iehgb   45.0        5      no
j     cbvm   65.0        6     yes

In [53]:
### exercise 3
df1 = df[df['attemps'] > 2]
df1

     name  score  attemps qualify
e    isis    NaN        3     yes
f   osmel   34.0        3     yes
g  islwhg   65.0        4      no
h    xbnd    NaN        4     yes
i   iehgb   45.0        5      no
j    cbvm   65.0        6     yes

In [56]:
### exercise 6
# write a pandas program to selet the rows where the score is missing
df[df['score'].isnull()]

   name  score  attemps qualify
e  isis    NaN        3     yes
h  xbnd    NaN        4     yes

In [58]:
#Exercise 7
# Write a pandas program to select the rows where the score is greater than 15
df[df['score'] > 15]

      name  score  attemps qualify
a     jose   23.0        1     yes
b     juan   34.0        1      no
c  alberto  456.0        2     yes
d     ksks   87.0        2      no
f    osmel   34.0        3     yes
g   islwhg   65.0        4      no
i    iehgb   45.0        5      no
j     cbvm   65.0        6     yes

In [ ]:
#Exercise 8 
# write a pandas proogram to select the rows where number of attempts in the examination is less than 2 and score greater than 15

df1 = df[df['attemps']<2]
df2 = df1[df1['score']>25]
df[(df['attemps'] < 2) & (df['score'] > 25)]

   name  score  attemps qualify
b  juan   34.0        1      no

In [68]:
## Exercise 10
# write a pandas program to calculate the sum of the examination attempts by the students
sum(df['attemps'])

31

In [77]:
## Exercise 11
# write a pandas program to calculate the mean score of the class
df['score'].mean()

np.float64(101.125)

In [4]:
import pandas as pd
import numpy as np

In [6]:
serie = pd.Series([5,np.nan, 12, -3, np.nan, 9], index=['a', 'b', 'c', 'd', 'e', 'f'])
print(serie)
print("1. Print all non-NaN values:\n ", serie[serie.notnull()])

a     5.0
b     NaN
c    12.0
d    -3.0
e     NaN
f     9.0
dtype: float64
1. Print all non-NaN values:
  a     5.0
c    12.0
d    -3.0
f     9.0
dtype: float64

In [8]:
print("2. Replace the NaN values with the mean of non-NaN values:\n",)
serie[serie.isnull()] = serie[serie.notnull()].mean()
print(serie)

2. Replace the NaN values with the mean of non-NaN values:

a     5.00
b     5.75
c    12.00
d    -3.00
e     5.75
f     9.00
dtype: float64

In [ ]:

print("1. Load the CSV in numpy: ")
arr = np.genfromtxt("employees.csv", delimiter=",",names=True)
print(arr)
print("2. Print the age of all employees:", arr["age"])
print("3. Count the missing (NaN) ages:", np.count_nonzero(np.isnan(arr["age"])))
print("4.Compute the mean salary of employes older than 28 (ignoring NaN values), round to 2 decimals:",   )

1. Load the CSV in numpy:
[(1., 25., 37000.) (2., 31., 45000.) (3., nan, 52000.) (4., 29., 48000.)]
2. Print the age of all employees: [25. 31. nan 29.]

In [2]:
#Cours 21/11/2025

ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
print(ser.index)

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [5]:
ser.idxmin()
ser.idxmax()

'white'

In [6]:
ser = pd.Series(range(6),index=['white','white','blue','green','green','yellow'])
ser

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [7]:
ser.index.is_unique

False

In [10]:
ser = pd.Series([1,2,3,4], index =['one','two','three','four'])
print(ser)
print(ser.reindex(['three','four','five','one']))

one      1
two      2
three    3
four     4
dtype: int64
three    3.0
four     4.0
five     NaN
one      1.0
dtype: float64

In [12]:
ser = pd.Series([1,5,6,3], index=[0,3,5,6])
print(ser)
print(ser.reindex(range(6), method='ffill')) # asigna los valores acuerdo al index que tenian, y
#en lugar de eliminar los elementos cuyos index no tiene un elemento, los rellena con el elemento anterior

0    1
3    5
5    6
6    3
dtype: int64
0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

#### Fill Indexes
Reindexing -> bfill -> backward fill

In [ ]:
data = {'color': ['blue','green','yellow','red','white'],
        'object': ['ball','pen','pencil','paper','mug'], 
        'price': [1.2, 1.0, 0.6, 0.9, 1.5]}
frame = pd.DataFrame(data)
print(frame)
print(frame.reindex(method='bfill',columns=['color','price','new','object'])) #Gives the new column, the information of the next content
# in another words, the column in front the new and void column, fill backwards the column

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.5
    color  price     new  object
0    blue    1.2    ball    ball
1   green    1.0     pen     pen
2  yellow    0.6  pencil  pencil
3     red    0.9   paper   paper
4   white    1.5     mug     mug

In [14]:
ser = pd.Series(np.arange(4.),index=['red','blue','yellow','white'] )
print(ser)

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [16]:
ser.drop(['blue','white'])

red       0.0
yellow    2.0
dtype: float64

In [17]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index=['red','blue','yellow','white'],
                      columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
                      index=['blue','green','white','yellow'],
                      columns=['mug','pen','ball'])

print(frame1 + frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [19]:
print(frame1.add(frame2))

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [20]:
print(frame1/frame2)

            ball  mug  paper       pen  pencil
blue    2.000000  NaN    NaN  5.000000     NaN
green        NaN  NaN    NaN       NaN     NaN
red          NaN  NaN    NaN       NaN     NaN
white   1.500000  NaN    NaN  1.857143     NaN
yellow  0.727273  NaN    NaN  0.900000     NaN

In [ ]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])
ser = pd.Series([0,1,2,3,4], index=['ball','pen','moug','paper','pencil'])
print(frame - ser)

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15
        ball  moug  paper  pen  pencil
red        0   NaN      0    0      -2
blue       4   NaN      4    4       2
yellow     8   NaN      8    8       6
white     12   NaN     12   12      10

In [22]:
np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [27]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [29]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
print(frame)

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [ ]:
frame = pd.DataFrame(np.random.randint(0,10,16).reshape(4,4),
                     index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])
print(frame)
print(frame.sort_values(by='pen')) #Se ordena el dataframe por los valores de la columna 'pen',
# primero la columna pen y luego las otras columnas se reordenan acorde en la fila correspondiente con los valores de la columna pen

        ball  pen  pencil  paper
red        6    4       3      5
blue       4    4       9      3
yellow     1    6       4      3
white      0    9       5      4
        ball  pen  pencil  paper
red        6    4       3      5
blue       4    4       9      3
yellow     1    6       4      3
white      0    9       5      4

### Chapter 3
Reading and writing data

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('testPatate.csv')
df

   id     Fname      Lname  Weight
0   1    Machin     Bidule    59.5
1   2    Leonel  Hernandez    62.5
2   3  Charabia   Barratin    89.0

In [5]:
df2 = pd.read_table('testPatate.csv',delimiter=",")
df2

   id     Fname      Lname  Weight
0   1    Machin     Bidule    59.5
1   2    Leonel  Hernandez    62.5
2   3  Charabia   Barratin    89.0

In [ ]:
df3 = pd.read_csv('testPatate.csv',header=None) ##give the header numbers as header
df3

    0         1          2       3
0  id     Fname      Lname  Weight
1   1    Machin     Bidule    59.5
2   2    Leonel  Hernandez    62.5
3   3  Charabia   Barratin      89